EDT/УТ/src/Reports/СборкаЗаказов/СборкаЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СборкаЗаказов</name>
</mdclass:Report>

EDT/УТ/src/InformationRegisters/СтатусыЗаказов/СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаказов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>СтатусAxiomus</name>
    <type>
      <types>CatalogRef.СтатусыAxiomus</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредварительноеЗакрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инициатор</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/ИзменениеДатыДоставки/ИзменениеДатыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеДатыДоставки</name>
  <basedOn>Document.новаОтчетВодителя</basedOn>
  <registerRecords>InformationRegister.СостоянияЗаказов</registerRecords>
  <registerRecords>InformationRegister.ДатыДоставок</registerRecords>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорректироватьДатуВАдминке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияДаты</name>
    <type>
      <types>EnumRef.ПричиныИзмененияДатыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная003</name>
    <type>
      <types>DocumentRef.Накладная003</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>axi</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгруженоВOZONE</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиСтарая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторСостояния</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаСТСД</name>
    <type>
      <types>DocumentRef.ЗагрузкаСТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетВодителя</name>
    <type>
      <types>DocumentRef.новаОтчетВодителя</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/Catalogs/РегиональныеТерминалы/РегиональныеТерминалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегиональныеТерминалы</name>
  <predefined>
    <items>
      <name>МоскваСтриж</name>
      <description>Москва Стриж</description>
    </items>
    <items>
      <name>СПбСтриж</name>
      <description>СПб Стриж</description>
    </items>
  </predefined>
  <attributes>
    <name>КодТерминала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Самовывоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДнейОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДнейДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическаяЗонаДоставки</name>
    <type>
      <types>CatalogRef.новаРайоны</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьСМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗакрытияОперДня</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеглЗаданиеЗакрытиеОперДня</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_АдресБоевогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_БоевойСерверИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_БоевойСерверПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_АдресТестовогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ТестовыйСерверИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ТестовыйСерверПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяШиротаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяДолготаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяШиротаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДолготаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксАдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_АккаунтБоевогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_АккаунтТестовогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ИдРаспредЦентраБоевогоСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ИдРаспредЦентраТестовогоСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаСтаршегоЛогиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПечатиЧековРМЭкипажа</name>
    <type>
      <types>EnumRef.ВариантыПечатиЧековРМЭкипажа</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверККМ</name>
    <type>
      <types>ExchangePlanRef.ОбменСКассовымСервером</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_ОсновнойРаспределительныйЦентр</name>
    <type>
      <types>CatalogRef.РаспределительныеЦентрыVeeroute</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаЦентраЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаЦентраЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИнтервалаДоставкиВОбласти</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИнтервалаДоставкиВОбласти</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/МестаПоЗаказам/МестаПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МестаПоЗаказам</name>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМеста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторМеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеАктуальное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Reports/СборкаЗаказов/ObjectModule.bsl
Функция СформироватьОтправитьПоПочте(НачПериода, КонПериода, СледующийДень, КонтрагентыЦелевые) Экспорт
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек.Найти("Сборка").Настройки);
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачПериода);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОкончаниеПериода", КонПериода);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СледующийДень", СледующийДень);
	
	Если КонтрагентыЦелевые <> Неопределено Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВладелецТовара");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = КонтрагентыЦелевые;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);	
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,, Истина);
	
	РезультатСборка	= Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(РезультатСборка);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	//Сообщить("ВысотаТаблицы " + Результат.ВысотаТаблицы);
	//Сообщить("ФиксацияСверху " + Результат.ФиксацияСверху);
	Если Не (РезультатСборка.ВысотаТаблицы - РезультатСборка.ФиксацияСверху - 1) Тогда//Итого -1
		Возврат Неопределено;
	КонецЕсли;
	
	//доп оформление>>>
	РезультатСборка.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	НомерПоследнейКолонки = РезультатСборка.ШиринаТаблицы;
	Если НомерПоследнейКолонки Тогда
		ЖирнаяЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);
		
		НомерПервойСтроки = 2;
		НомерПоследнейСтроки = РезультатСборка.ВысотаТаблицы - 1;
		ПредыдущийЗаказ = РезультатСборка.Область(НомерПервойСтроки, 1, НомерПервойСтроки, 1).Текст;
		Для НомерСтроки = НомерПервойСтроки По НомерПоследнейСтроки Цикл
			ТекущийЗаказ = РезультатСборка.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
			Если ТекущийЗаказ <> ПредыдущийЗаказ Тогда
				ПредыдущийЗаказ = ТекущийЗаказ;
				РезультатСборка.Область(НомерСтроки, 1, НомерСтроки, НомерПоследнейКолонки).ГраницаСверху = ЖирнаяЛиния;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//доп оформление<<<
	
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек.Найти("Подбор").Настройки);
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачПериода);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОкончаниеПериода", КонПериода);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СледующийДень", СледующийДень);
	
	Если КонтрагентыЦелевые <> Неопределено Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВладелецТовара");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = КонтрагентыЦелевые;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);	
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,, Истина);
	
	РезультатПодбор	= Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(РезультатПодбор);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	// Создаем пакет
	Пакет = Новый ПакетОтображаемыхДокументов;

	// Документы, находящиеся в этом пакете, печатаются в 5 экземплярах
	//Пакет.КоличествоЭкземпляров = 5;
	
	// Добавляем документы в пакет
	ЭлементПакета1 = Пакет.Состав.Добавить();
	ЭлементПакета1.Данные = ПоместитьВоВременноеХранилище(РезультатСборка);
	ЭлементПакета1.Наименование = "Сборка";
	ЭлементПакета2 = Пакет.Состав.Добавить();
	ЭлементПакета2.Данные = ПоместитьВоВременноеХранилище(РезультатПодбор);
	ЭлементПакета2.Наименование = "Подбор";
	
	// Добавляем вложенный пакет для третьего документа
	//ВложенныйПакет = Новый ПакетОтображаемыхДокументов;
	//ЭлементПакета3 = Пакет.Состав.Добавить();
	//ЭлементПакета3.Данные = ВложенныйПакет;
	
	// Документ во вложенном пакете печатается в 2 экземплярах
	//ВложенныйПакет.КоличествоЭкземпляров = 2;
	
	// Добавляем документ во вложенный пакет
	//ЭлементВложенногоПакета1 = ВложенныйПакет.Состав.Добавить();
	//ЭлементВложенногоПакета1.Данные = ПоместитьВоВременноеХранилище(ТабличныйДокумент3, УникальныйИдентификатор);
	
	// Печатаем пакет
	//Пакет.Напечатать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонПериода);
	Запрос.УстановитьПараметр("СледующийДень", СледующийДень);
	ТекстЗапроса = Новый Массив;
	
	Если КонтрагентыЦелевые = Неопределено Тогда
		ТекстЗапроса.Добавить(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ.ИзменениеДатыДоставки КАК ИзменениеДатыДоставки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО (ИзменениеДатыДоставки.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			И (ИзменениеДатыДоставки.ДатаДоставки >= &СледующийДень)
		|			И (ИзменениеДатыДоставки.Проведен)
		|			И ИзменениеДатыДоставки.Заказ = РеализацияТоваровУслуг.Ссылка
		|			И (РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
		|		ПО ИзменениеДатыДоставки.Заказ = СтатусыЗаказов.Заказ
		|			И (СтатусыЗаказов.Статус = 211)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеДатыДоставки КАК ИзменениеДатыДоставки_Ранние
		|		ПО ИзменениеДатыДоставки.Заказ = ИзменениеДатыДоставки_Ранние.Заказ
		|			И (ИзменениеДатыДоставки_Ранние.Дата < &НачалоПериода)
		|			И (ИзменениеДатыДоставки_Ранние.Проведен)
		|ГДЕ
		|	СтатусыЗаказов.Заказ ЕСТЬ NULL
		|	И ИзменениеДатыДоставки_Ранние.Заказ ЕСТЬ NULL");
	Иначе
		Запрос.УстановитьПараметр("КонтрагентыЦелевые", КонтрагентыЦелевые);
		ТекстЗапроса.Добавить(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ.ИзменениеДатыДоставки КАК ИзменениеДатыДоставки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО (ИзменениеДатыДоставки.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			И (ИзменениеДатыДоставки.ДатаДоставки >= &СледующийДень)
		|			И (ИзменениеДатыДоставки.Проведен)
		|			И ИзменениеДатыДоставки.Заказ = РеализацияТоваровУслуг.Ссылка
		|			И (РеализацияТоваровУслуг.ВладелецТовара В (&КонтрагентыЦелевые))
		|			И (РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
		|		ПО ИзменениеДатыДоставки.Заказ = СтатусыЗаказов.Заказ
		|			И (СтатусыЗаказов.Статус = 211)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеДатыДоставки КАК ИзменениеДатыДоставки_Ранние
		|		ПО ИзменениеДатыДоставки.Заказ = ИзменениеДатыДоставки_Ранние.Заказ
		|			И (ИзменениеДатыДоставки_Ранние.Дата < &НачалоПериода)
		|			И (ИзменениеДатыДоставки_Ранние.Проведен)
		|ГДЕ
		|	СтатусыЗаказов.Заказ ЕСТЬ NULL
		|	И ИзменениеДатыДоставки_Ранние.Заказ ЕСТЬ NULL");
	КонецЕсли;
	
	ТекстЗапроса.Добавить(
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|");
	
	ТекстЗапроса.Добавить(
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	|	РеализацияТоваровУслуг.Номер КАК НомерЗаказа,
	|	ВЫБОР РеализацияТоваровУслуг.ТерминалДоставки
	|		КОГДА ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
	|			ТОГДА ""МСК""
	|		КОГДА ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.СПбСтриж)
	|			ТОГДА ""СПБ""
	|		ИНАЧЕ ""???""
	|	КОНЕЦ КАК РегионДоставки,
	|	РеализацияТоваровУслуг.ВладелецТовара.Наименование КАК ПартнерНаименование,
	|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	|	ВЫБОР РеализацияТоваровУслуг.ТерминалПриема
	|		КОГДА ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.МоскваСтриж)
	|			ТОГДА ""МСК""
	|		КОГДА ЗНАЧЕНИЕ(Справочник.РегиональныеТерминалы.СПбСтриж)
	|			ТОГДА ""СПБ""
	|		ИНАЧЕ ""???""
	|	КОНЕЦ КАК РегионОтгрузки,
	|	МестаПоЗаказам.Штрихкод КАК Штрихкод
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Заказы.Ссылка = РеализацияТоваровУслуг.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МестаПоЗаказам КАК МестаПоЗаказам
	|		ПО ВТ_Заказы.Ссылка = МестаПоЗаказам.Заказ
	|			И (НЕ МестаПоЗаказам.НеАктуальное)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПартнерНаименование,
	|	НомерВнешнегоЗаказа,
	|	Штрихкод
	|ИТОГИ
	|	КОЛИЧЕСТВО(Штрихкод)
	|ПО
	|	Заказ");	
	
	Запрос.Текст = СтрСоединить(ТекстЗапроса);
	Результат = Запрос.Выполнить();
	
	РезультатЭтикетки = Новый ТабличныйДокумент;
	РезультатЭтикетки.РазмерСтраницы = "Custom";
	РезультатЭтикетки.ВысотаСтраницы = 126;
	РезультатЭтикетки.ШиринаСтраницы = 80;
	РезультатЭтикетки.ПолеСлева = 5;
	РезультатЭтикетки.ПолеСверху = 5;
	РезультатЭтикетки.ПолеСправа = 5;
	РезультатЭтикетки.ПолеСнизу = 5;
	РезультатЭтикетки.АвтоМасштаб = Истина;
	
	Макет = ПолучитьМакет("Этикетка");
	Область = Макет.ПолучитьОбласть("Этикетка");
	ПараметрыОбласти = Область.Параметры;
	
	ВыборкаЗаказ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗаказ.Следующий() Цикл
		КоличествоМест = ВыборкаЗаказ.Штрихкод;
		НомерМеста = 0;
		Выборка = ВыборкаЗаказ.Выбрать();
		Пока Выборка.Следующий() Цикл
			НомерМеста = НомерМеста + 1;
			ПараметрыОбласти.Заполнить(Выборка);
			ПараметрыОбласти.НомерЗаказа = СокрЛП(ПараметрыОбласти.НомерЗаказа);
			ПараметрыОбласти.НомерМеста = НомерМеста;
			ПараметрыОбласти.КоличествоМест = КоличествоМест;
			ПараметрыОбласти.ШК = may.ШтрихкодCode128(Выборка.Штрихкод);
			РезультатЭтикетки.Вывести(Область);
			РезультатЭтикетки.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;
	КонецЦикла;
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Пакет);
	МассивДокументов.Добавить(РезультатЭтикетки);
	
	Возврат МассивДокументов;
	
КонецФункции
